In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
my_data = pd.DataFrame({'type' : ['A','A','B', 'B'],   'value' : [10,14,12,23]})

In [3]:
my_data

  type  value
0    A     10
1    A     14
2    B     12
3    B     23

In [4]:
my_stat = pd.read_csv('https://stepik.org/media/attachments/course/4852/my_stat.csv')

In [7]:
my_stat.shape

(500, 4)

In [6]:
my_stat.head()

   V1    V2 V3   V4
0   2  13.0  B  1.0
1  -1   7.0  B  1.0
2   0  11.0  A  0.0
3   2  11.0  A  2.0
4   0  10.0  B -1.0

In [11]:
subset_1 = my_stat.iloc[:10,[0,2]]

In [41]:
subset_1.head()

    V1    V2 V3   V4
3    2  11.0  A  2.0
5    2  11.0  A  0.0
7    1   9.0  A  1.0
10   1  10.0  A  1.0
13   1  12.0  A  3.0

In [18]:
my_stat.drop?

In [23]:
subset_2 = my_stat.drop(index=[0,4],columns=['V1', 'V3'])

In [27]:
subset_1 = my_stat[(my_stat['V1'] > 0)  & (my_stat['V3'] == 'A') ]

In [31]:
subset_2 = my_stat[(my_stat['V2'] != 10)  | (my_stat['V4'] >= 1) ]

In [32]:
subset_2.head()

   V1    V2 V3   V4
0   2  13.0  B  1.0
1  -1   7.0  B  1.0
2   0  11.0  A  0.0
3   2  11.0  A  2.0
5   2  11.0  A  0.0

In [33]:
my_stat['V5'] = my_stat['V1'] + my_stat['V4']

In [34]:
my_stat['V6'] = my_stat['V2'].apply(np.log)

In [35]:
my_stat.head()

   V1    V2 V3   V4   V5        V6
0   2  13.0  B  1.0  3.0  2.564949
1  -1   7.0  B  1.0  0.0  1.945910
2   0  11.0  A  0.0  0.0  2.397895
3   2  11.0  A  2.0  4.0  2.397895
4   0  10.0  B -1.0 -1.0  2.302585

In [38]:
my_stat.rename(columns={'V1' : 'session_value', \
                       'V2': 'group', \
                       'V3' : 'time', \
                       'V4' : 'n_users'}, inplace=True)

In [40]:
my_stat.head()

   session_value  group time  n_users   V5        V6
0              2   13.0    B      1.0  3.0  2.564949
1             -1    7.0    B      1.0  0.0  1.945910
2              0   11.0    A      0.0  0.0  2.397895
3              2   11.0    A      2.0  4.0  2.397895
4              0   10.0    B     -1.0 -1.0  2.302585

In [42]:
df_na = pd.read_csv('https://stepik.org/media/attachments/course/4852/my_stat_na.csv')

In [43]:
df_na.head()

   group  n_users  session_value time
0    9.0     -9.0            1.0    A
1   10.0      8.0            2.0    B
2   10.0     -1.0            4.0    A
3   10.0     -0.0            0.0    B
4    9.0    -15.0           -1.0    B

In [49]:
df_na.fillna?

In [46]:
df_na.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 4 columns):
group            500 non-null float64
n_users          500 non-null float64
session_value    487 non-null float64
time             500 non-null object
dtypes: float64(3), object(1)
memory usage: 15.7+ KB

In [52]:
df_na.fillna(value={'session_value' : 0}, inplace=True)

In [59]:
median_ = df_na[df_na['n_users'] >= 0]['n_users'].median()

In [62]:
df_na['n_users'] = df_na['n_users'].apply(lambda x : median_ if x < 0  else x )

In [64]:
df_na.head(10)

   group  n_users  session_value time
0    9.0      7.0            1.0    A
1   10.0      8.0            2.0    B
2   10.0      7.0            4.0    A
3   10.0     -0.0            0.0    B
4    9.0      7.0           -1.0    B
5   11.0      7.0            0.0    B
6   10.0      7.0            0.0    B
7   10.0      1.0            0.0    B
8    9.0      3.0            0.0    B
9   11.0     11.0            0.0    A

In [70]:
my_stat.groupby('group', as_index=False).agg({'session_value': 'mean'}).rename(columns={'session_value' : 'mean_session_value'})

   group  mean_session_value
0    5.0            0.000000
1    7.0            0.333333
2    8.0            0.633333
3    9.0            0.238938
4   10.0            0.065990
5   11.0           -0.081081
6   12.0           -0.078947
7   13.0            0.000000